{"modelTopology": {"keras_version": "2.2.2", "backend": "tensorflow", "training_config": {"loss": "categorical_crossentropy", "sample_weight_mode": null, "loss_weights": null, "metrics": ["accuracy"], "optimizer_config": {"config": {"lr": 0.0010000000474974513, "rho": 0.8999999761581421, "epsilon": 1e-07, "decay": 0.0}, "class_name": "RMSprop"}}, "model_config": {"config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 32, 32, 3], "kernel_size": [2, 2], "filters": 16, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "dtype": "float32", "name": "conv2d_1"}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 32, "strides": [1, 1], "name": "conv2d_2", "kernel_size": [2, 2], "data_format": "channels_last", "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 64, "strides": [1, 1], "name": "conv2d_3", "kernel_size": [2, 2], "data_format": "channels_last", "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "trainable": true, "seed": null, "rate": 0.3, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_1", "units": 500, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"noise_shape": null, "trainable": true, "seed": null, "rate": 0.4, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_2", "units": 10, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "softmax", "bias_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"shape": [2, 2, 3, 16], "name": "conv2d_1/kernel", "dtype": "float32"}, {"shape": [16], "name": "conv2d_1/bias", "dtype": "float32"}, {"shape": [2, 2, 16, 32], "name": "conv2d_2/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_2/bias", "dtype": "float32"}, {"shape": [2, 2, 32, 64], "name": "conv2d_3/kernel", "dtype": "float32"}, {"shape": [64], "name": "conv2d_3/bias", "dtype": "float32"}, {"shape": [1024, 500], "name": "dense_1/kernel", "dtype": "float32"}, {"shape": [500], "name": "dense_1/bias", "dtype": "float32"}, {"shape": [500, 10], "name": "dense_2/kernel", "dtype": "float32"}, {"shape": [10], "name": "dense_2/bias", "dtype": "float32"}]}]}